In [22]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
actors = pd.read_csv("./movies-1990-to-2017/Movie_Actors.csv")
actors = actors.iloc[:,1:]
actors.tail()

                    Actors     imdbID
143864   Jonathan Lipnicki  tt0164912
143865         James Woods  tt0146838
143866    Brittany Colonna  tt0125664
143867       Tony Shalhoub  tt0177789
143868      Cate Blanchett  tt0134119

In [4]:
# checking for any missing values in any of the rows
null_columns=actors.columns[actors.isnull().any()]
actors[null_columns].isnull().sum()

Series([], dtype: float64)

In [20]:
actors['Actors'][1]

' Charles A. Post'

In [ ]:
# Checking for any repeating values of imdbIDs in actors
for i in range(actors.shape[0]):
    for j in range(i+1,actors.shape[0]):
        if actors['imdbID'][i] == actors['imdbID'][j]:
            print(actors['Actors'][i])

In [5]:
rating = pd.read_csv("./movies-1990-to-2017/Movie_AdditionalRating.csv")
rating = rating.iloc[:,1:]
rating.tail()

       Rating             RatingSource     imdbID
92011     52%          Rotten Tomatoes  tt0145653
92012  54/100               Metacritic  tt0145653
92013  7.6/10  Internet Movie Database  tt0174856
92014     83%          Rotten Tomatoes  tt0174856
92015  74/100               Metacritic  tt0174856

In [6]:
# checking for any missing values in any of the rows
null_cols = rating.columns[rating.isnull().any()]
rating[null_cols].isnull().sum()

Series([], dtype: float64)

In [7]:
genres = pd.read_csv("./movies-1990-to-2017/Movie_Genres.csv")
genres = genres.iloc[:,1:]
genres.tail()

            Genre     imdbID
308560     Comedy  tt0177789
308561     Sci-Fi  tt0177789
308562      Crime  tt0134119
308563      Drama  tt0134119
308564   Thriller  tt0134119

In [8]:
# checking for any missing values in any of the rows
null_cols = genres.columns[genres.isnull().any()]
genres[null_cols].isnull().sum()

Series([], dtype: float64)

In [9]:
movies = pd.read_csv("./movies-1990-to-2017/Movie_Movies.csv")
movies = movies.iloc[:,1:]
movies.tail()

/home/ijaju/.local/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (18) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Awards,BoxOffice,Country,DVD,Director,Language,Metascore,Plot,Poster,Production,...,Released,Response,Runtime,Title,Type,Website,Year,imdbID,imdbRating,imdbVotes
178682,Nominated for 1 Oscar. Another 7 wins & 13 nom...,NaN,"Germany, USA",18 Apr 2000,Rob Minkoff,"English, Dutch",61.0,The Little family adopt a charming young mouse...,https://images-na.ssl-images-amazon.com/images...,Columbia Pictures,...,17 Dec 1999,True,84 min,Stuart Little,movie,http://www.spe.sony.com/movies/stuartlittle/sp...,1999,tt0164912,5.9,"106,665"
178683,3 wins & 9 nominations.,NaN,USA,05 Sep 2000,Oliver Stone,English,52.0,A behind-the-scenes look at the life-and-death...,https://ia.media-imdb.com/images/M/MV5BZDk2YTQ...,Warner Bros. Pictures,...,22 Dec 1999,True,162 min,Any Given Sunday,movie,http://www.anygivensunday.net,1999,tt0146838,6.8,"103,302"
178684,Won 1 Golden Globe. Another 4 wins & 23 nomina...,NaN,"UK, Germany, Japan, USA",30 May 2000,Milos Forman,English,58.0,"The life and career of a legendary comedian, A...",https://ia.media-imdb.com/images/M/MV5BNDI1Mjc...,Universal,...,22 Dec 1999,True,118 min,Man on the Moon,movie,http://www.universalpictures.com/manonthemoon,1999,tt0125664,7.4,"110,566"
178685,7 wins & 14 nominations.,NaN,USA,02 May 2000,Dean Parisot,English,70.0,The alumni cast of a space opera television se...,https://ia.media-imdb.com/images/M/MV5BNmZlNTY...,DreamWorks SKG,...,25 Dec 1999,True,102 min,Galaxy Quest,movie,http://www.amazon.com/exec/obidos/subst/video/...,1999,tt0177789,7.3,"132,448"
178686,Nominated for 5 Oscars. Another 10 wins & 75 n...,NaN,USA,27 Jun 2000,Anthony Minghella,"English, Italian",76.0,"In late 1950s New York, Tom Ripley, a young un...",https://images-na.ssl-images-amazon.com/images...,Paramount Pictures,...,25 Dec 1999,True,139 min,The Talented Mr. Ripley,movie,http://www.talentedmrripley.com,1999,tt0134119,7.4,"151,938"

In [10]:
# checking for any null/missing values in any of the rows
null_cols = movies.columns[movies.isnull().any()]
movies[null_cols].isnull().sum()

Awards        158347
BoxOffice     177239
Country        12689
DVD           162738
Director       27334
Language       25491
Metascore     172889
Plot           81211
Poster        130273
Production    162241
Rated         154781
Released       61713
Runtime        59190
Title              1
Type               1
Website       171940
Year               1
imdbID             1
imdbRating    116614
imdbVotes     116658
dtype: int64

In [23]:
movies.dtypes

Awards         object
BoxOffice      object
Country        object
DVD            object
Director       object
Language       object
Metascore     float64
Plot           object
Poster         object
Production     object
Rated          object
Released       object
Response         bool
Runtime        object
Title          object
Type           object
Website        object
Year           object
imdbID         object
imdbRating    float64
imdbVotes      object
dtype: object

In [25]:
movies['Awards']

0                                                       NaN
1                                                       NaN
2                                                       NaN
3                                                       NaN
4                                                       NaN
5                                                       NaN
6                                                       NaN
7                                                       NaN
8                                                       NaN
9                                                       NaN
10                                                      NaN
11                                                      NaN
12                                                      NaN
13                                                      NaN
14                                                      NaN
15                                                   1 win.
16                                                      NaN
17                                                      NaN
18                                                      NaN
19                                                      NaN
20                                                      NaN
21                                            1 nomination.
22                                                      NaN
23                                                      NaN
24                                                      NaN
25                                                      NaN
26                                                      NaN
27                                            1 nomination.
28                                                      NaN
29                                                      NaN
                                ...
178657                                       2 nominations.
178658                                                  NaN
178659    Nominated for 1 Oscar. Another 10 wins & 34 no...
178660                                                  NaN
178661                              2 wins & 4 nominations.
178662                             7 wins & 11 nominations.
178663                                                  NaN
178664                               1 win & 3 nominations.
178665    Nominated for 2 Oscars. Another 5 wins & 9 nom...
178666                               1 win & 2 nominations.
178667                               1 win & 3 nominations.
178668    Nominated for 7 Oscars. Another 23 wins & 50 n...
178669                                       8 nominations.
178670                             5 wins & 13 nominations.
178671                                       2 nominations.
178672       Won 1 Oscar. Another 24 wins & 39 nominations.
178673                               1 win & 7 nominations.
178674                              3 wins & 4 nominations.
178675                                       5 nominations.
178676    Nominated for 2 Oscars. Another 2 wins & 25 no...
178677    Nominated for 4 Oscars. Another 15 wins & 32 n...
178678       Won 2 Oscars. Another 6 wins & 29 nominations.
178679                                       2 nominations.
178680                                               1 win.
178681    Nominated for 1 Oscar. Another 2 wins & 7 nomi...
178682    Nominated for 1 Oscar. Another 7 wins & 13 nom...
178683                              3 wins & 9 nominations.
178684    Won 1 Golden Globe. Another 4 wins & 23 nomina...
178685                             7 wins & 14 nominations.
178686    Nominated for 5 Oscars. Another 10 wins & 75 n...
Name: Awards, Length: 178687, dtype: object

In [ ]:
movies['Oscar-wins'] = np.where

In [11]:
writer = pd.read_csv("./movies-1990-to-2017/Movie_Writer.csv")
writer = writer.iloc[:,1:]
writer.tail()

                   Person Responsibility     imdbID
66159        David Howard          story  tt0177789
66160        David Howard     screenplay  tt0177789
66161       Robert Gordon     screenplay  tt0177789
66162  Patricia Highsmith          novel  tt0134119
66163   Anthony Minghella     screenplay  tt0134119

In [12]:
# checking for any null/missing values in any of the rows
null_cols = writer.columns[writer.isnull().any()]
writer[null_cols].isnull().sum()

Series([], dtype: float64)

In [13]:
import matplotlib.pyplot as plt
writer_ = writer
print(writer_['Responsibility'].unique())

['story' 'scenario' 'screenplay' ... 'based on the book "The Iron Man" by'
 'story "The Legend of Sleepy Hollow"'
 'short story "The Bicentennial Man"']